from WordReportBuilder import WordReportBuilder
import os
import warnings

warnings.filterwarnings("ignore", category=UserWarning, module="docx")

lr_number = 2
imagesNumber = 1


def add_listings_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    listingsNumber = 0

    code_extensions = {
        '.c', '.cpp', '.h', '.py', '.java', '.js', '.ts', '.rb', '.go', '.php',
        '.html', '.css', '.sh', '.pl', '.swift', '.kt', '.scala', '.r', '.lua',
        '.m', '.sql', '.bash'
    }

    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and any(file_name.lower().endswith(ext) for ext in code_extensions):
                try:
                    with open(file_path, 'r', encoding='utf-8') as f:
                        code = f.read()

                    listingsNumber += 1
                    report.add_listing(f"Лістинг {lr_number}.{listingsNumber} – Вміст {file_name}", code)
                except Exception as e:
                    print(f"Ошибка при обработке файла {file_name}: {e}")


def add_images_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    imagesNumber = 0

    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and file_path.lower().endswith(('.png', '.jpg', '.jpeg')):
                imagesNumber += 1

                report.append_text(f"Soooooomeeeee зображено на рисунку {lr_number}.{imagesNumber}.")
                report._add_blank_line()

                report.add_image(file_path, f"Рисунок {lr_number}.{imagesNumber} – Головне вікно програми")


if __name__ == '__main__':
    rep = WordReportBuilder("Звіт.docx")

    rep.add_section_title("ЛАБОРАТОРНА РОБОТА № 2")
    rep.add_lab_topic("Знайомство з MS-Project.")
    rep.add_lab_goal("Мета: Ознайомитись з можливостями MS-Project.")

    rep.add_lab_process("Підготовка до виконання завдання")
    rep.add_list(
        "Підготовка звітного документа:",
        """
        Створіть файл у Microsoft Word із іменем за шаблоном: Звіт_лр_№_прізвище_група (де «№» – номер лабораторної роботи, «прізвище» та «група» – відповідно прізвище студента та номер групи).
        На кожну виконану дію робіть скріншот, який буде додано до звіту. Рисунки нумеруйте відповідно до номера лабораторної роботи (наприклад, для ЛР1 – 1.1, 1.2, …; для ЛР2 – 2.1, 2.2, …).
        """
    )

    rep.add_list(
        "Теоретична частика:",
        """
        Microsoft Project є додатком сімейства Microsoft Office. Призначення цієї програми - керування проєктами.
        Проєкт – це деяка задача з певними вихідними даними, результатами й запропонованими способами досягнення результату.
        Для виконання проєкту необхідна наявність певних трудових, часових і грошових ресурсів. Спочатку складається розклад (план ) проєкту, у якому визначається, за допомогою яких робіт буде досягнута мета, які люди й обладнання, їхня зайнятість буде потрібнадля досягнення результату.
        Проєкт складається із задач, спрямованих на досягнення певного результату. Для виконання задачі на неї виділяються ресурси – матеріальні (обладнання ) і робітники (або співробітники). Виділення ресурсу на задачу називається призначенням. У задачі може бути необмежене число призначень, тобто на одну задачу можна призначити кілька ресурсів, як матеріальних, так і трудових. Задачі можуть поєднуватися в групи (або фази). Задача, що поєднує інші задачі, називається сумарною.
        Задача має тривалість, тобто час, який необхідно на її виконання. Також задача характеризується обсягом трудовитрат (обсягом робіт) і витратами (або вартістю), необхідними для її виконання.
        У плані проєкту задачі пов'язані з допомогою залежностей, що визначають порядок виконання задач відносно один одного. Тривалість проєкту складається із проміжків часу від початку самої ранньої задачі до закінчення найбільш пізньої з урахуванням залежностей між задачами. Якщо при збільшенні тривалості задачі збільшується тривалість усього проєкту, задача називається критичною.
        """
    )

    rep.add_lab_process("Хід виконання роботи")

    rep.add_list(
        "Інтерфейс програми MS Project",
        """
        Встановимо MS-Project
        При запуску програми вікно виглядає як на рисунку 2.1. Основні елементи вікна зображені й підписані на цьому рисунку
        Кнопка ліворуч на панелі інструментів на вкладці «Задача» яка має вибір у відображенні різних видів діограм та графіків. ЇЇ вигляд зображено на рисунку 2.2. Більше варіантів діаграм та графіків можливо відкрити при натскані пункту «Другие представления»
        """
    )

    rep.add_image("./Photos/ 1.png", f"Рисунок {lr_number}.{imagesNumber} – Інтерфейс програми Microsoft Project")
    rep.add_image("./Photos/ 2.png", f"Рисунок {lr_number}.{++imagesNumber} – Панель представлений і область задач")

    rep.add_list(
        "У	ході роботи можна перемикатися між наступними поданнями",
        """
        Діаграма Ганта (Диаграмма Ганта) – список задач із часовими відрізками на діаграмі. Це подання зручно використовувати при уведенні й плануванні задач
        Діаграма Ганта з відстеженням (Диаграмма Ганта с отслеживанием) – використається при відстеженні ходу виконання проєкту для порівняння запланованих і реальних строків виконання задач
        Сітковий графік (Сетевой график) – задачі представляються у вигляді блоків, з'єднаних стрілками відповідно до взаємозв'язків задач
        Календар (Календарь) – інформація виводиться у вигляді календаря по днях тижня, задачі відображаються відрізками
        Використання задач (Использование задач) – список задач із призначеними ресурсами
        Лист ресурсів (Лист ресурсов) – список ресурсів і всієї стосовної до них інформації, це подання зручно використовувати для уведення й редагування даних про ресурси
        Графік ресурсів (График ресурсов) – виведення на діаграмі інформації про вибрані ресурси: процентне завантаження, понаднормова робота тощо
        Використання ресурсів (Использование ресурсов) – список ресурсів і відомостей про призначення ресурсу, вартості, перевантаженню ресурсу
        """
    )

    rep.add_list(
        "Початок роботи із проектом в MS Project",
        """
        Планування починається з визначення проєкту, тобто опису його ключових характеристик, таких як загальна тривалість, робочий час і методика планування. Потім складається список фаз і задач, а також список необхідних для їхнього виконання ресурсів. Після цього в план вноситься додаткова інформація про задачі й ресурси, що буде використовуватися при визначенні призначень і надалі при проведенні робіт із плану (відстеженні плану). І тільки потім здійснюються призначення, після чого проєкт оптимізується, якщо тривалість або бюджет виявляються більше очікуваних величин.
        При запуску MS Project автоматично створюється новий проект. Якщо ж такого з якоїсь причини не відбулося або ви працювали з іншим проєктом, то для створення нового проєкту потрібно клацнути по кнопці Создать на стандартній панелі інструментів або виконати Файл  Создать. Для зміни параметрів проєкту варто виконати Проект  Сведения о проекте…,відкриється діалогове вікно (рисунок 2.3), у якому можна задати відповідні параметри.
        """
    )

    rep.add_image("./Photos/ 3.png", f"Рисунок {lr_number}.{++imagesNumber} – Діалогове вікно інформації про проєкт")

    rep.append_text(
        """
        За замовчуванням для проєкту встановлюється відлік від дати початку, тому дата закінчення проєкту неактивна. Часто проєкт планується таким чином, що він повинен бути обов'язково завершений до певної дати. У цьому випадку відома дата завершення, тоді для цього в списку, що розкривається, Планирование от потрібно вибрати даты окончания проекта. Потім під час складання плану визначається, коли проєкт повинен бути початий, щоб всі роботи були закінчені в строк.
        """
    )

    rep.append_text(
        """
        За замовчуванням для проєкту встановлюється стандартний календар, у якому вже встановлено час і початок роботи, а також час перерви. У цей календар не включені вихідні й скорочені дні. Часто такий варіант роботи не влаштовує при плануванні проєкту, тому можна змінити наявні настроювання або створити новий календар. Варто продумати, чи всі співробітники будуть працювати в одному режимі, якщо ні, то для певної групи співробітників варто створити календар і призначити його при плануванні робіт.    """
    )

    rep.append_text(
        """
        Для роботи з календарем виконайте Вид  Календарь…. У верхньому списку  відразу встановлений стандартний календар проєкту, так ще є календар для нічної зміни й 24-вартовий роботи. У центрі на календарі кольорами відповідно до легенди відразу відзначений робочий і неробочий час.
        """
    )

    rep.add_list(
        "Щоб створити новий календар, клацніть по кнопці Создать у діалоговому вікні зміни робочого часу, рисунок 2.4. Відкривається діалогове вікно, у якому потрібно вказати назву нового календаря й визначити, як буде створений новий календар",
        """
        на основі існуючого – варіант Создать копию календаря
        «з нуля» – варіант Создать новый базовый календарь.
        """
    )
    rep.add_image("./Photos/ 4.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Діалогове вікно зміни робочого часу в календарі")

    rep.add_list(
        "Введення даних про ресурси",
        """
        Для введення відомостей про ресурси потрібно відкрити Лист ресурсов через меню Вид або скористатися Панелью представлений. Дані можна починати безпосередньо вводити в таблицю, що з'явилася, рисунок 2.4. Після введення назви ресурсу йому автоматично привласнюється коротка назва, але ії можна змінити на свій розсуд. Для зручності введення можна скористатися діалоговим вікном,  подвійним клацанням по будь-якому осередку рядка потрібного ресурсу
        На вкладці Общие, рисунок 2.5 вводяться назва ресурсу і його дані. Ресурси проєкту можна об'єднати в групи, наприклад по ролі в проєкті або за назвою зовнішньої організації, що надала ресурс, або по іншій ознаці. Для цього на вкладці Общие є поле Группа. Ліворуч унизу можна задати доступність ресурсу, адже на період проєкту може бути заплановане відрядження, відпустка тощо
        """
    )

    rep.add_image("./Photos/ 4.png", f"Рисунок {lr_number}.{++imagesNumber} – Лист ресурсів")
    rep.add_image("./Photos/ 5.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Общие діалогового вікна введення даних про ресурс")

    rep.append_text("""
    Важлива властивість ресурсів — їхня вартість (витрати) використання в проєкті, рисунок 2.6. В MS Project є два типи вартості ресурсів: погодинна ставка (стандартная ставка) і вартість за використання (затраты на использование).
    Погодинна ставка виражається у вартості використання ресурсу в одиницю часу, наприклад 50 у.е. у годину або 500 у.е. у день. У цьому випадку вартість участі ресурсу в проєкті складає час, протягом якого він працює в проєкті, помножений на погодинну ставку. У цьому випадку також передбачається оплата за понаднормові часи роботи.
    Величина Затраты на использование позначає вартість використання обладнання або співробітника в задачі, що не залежить від того, скільки часу задіяний в задачі ресурс. Загальні витрати на використання ресурсу визначаються шляхом множення вартості використання на число задач, у яких він задіяний.
    У ресурсу може бути зазначена вартість як одного із двох типів, так і обох типів. При визначенні загальних витрат на використання ресурсу погодинні витрати й витрати на використання підсумуються.
    """)

    rep.add_image("./Photos/ 6.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")

    rep.add_list(
        "Введення даних про задачі",
        """
        План робіт найкраще складати в поданні Діаграма Ганта (меню Вид). Для додавання задачі (роботи) в план проєкту потрібно в таблицю ліворуч від діаграми послідовно ввести назву задачі, її тривалість тощо, рисунок 2.7. Для першої задачі дата початку автоматично призначається рівній даті початку проєкту, для всіх наступних завдань дата початку автоматично визначається залежно від тривалості, задач-попередників, задіяних ресурсів. При створенні завдання їй автоматично задається тривалість в 1 день і поруч додається знак питання. Знак питання позначає, що зазначена тривалість - приблизна й вимагає подальшого уточнення. Після подальшого редагування знак питання пропаде.
        Після введення відомостей про задачу праворуч на діаграмі з'явиться відрізок, що відображає задачу.
        На рисунку 2.8 показано введення задач для проєкту відкриття комп'ютерного клубу.
        """
    )

    rep.add_image("./Photos/ 7.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")
    rep.add_image("./Photos/ 8.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")

    rep.append_text("""
    Для зручності введення даних про задачу можна використати діалогове
    вікно, що викликається натисканням правої кнопки миші Сведения або подвійним щигликом по будь-якому осередку рядка потрібної задачі.
    На вкладці Общие (див. рис. 2.9) можна ввести назву задачі та її тривалість. У поле Пріоритет задається значення, що показує важливість і доступність задачі для вирівнювання завантаження ресурсів (див. Вирівнювання завантаження ресурсів). Першими затримуються або розділяються задачі з більше низьким пріоритетом.
    Пріоритети змінюються в діапазоні 0-1000 (найвищий пріоритет 1000, найнижчий 0). За замовчуванням пріоритет задачі дорівнює 500. Вищий пріоритет, рівний 1000, діє як заборона на вирівнювання й означає, що Project не буде відкладати або переривати дану задачу при вирівнюванні.
    """)

    rep.add_image("./Photos/ 9.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")

    rep.append_text("""
    На вкладці Предшественники, рисунок  2.10 задаються задачі-попередники, для вибору задачі поставте курсор в осередок стовпця Название задачи й виберіть відповідну назву задачі зі списку, що розкривається . При цьому автоматично визначається номер цієї задачі в списку. Якщо ж ви вирішили вводити дані про задачі без діалогового вікна , то при введенні декількох задач-попередників їх необхідно розділити крапкою з комою.
    Відомості про задіяні ресурси аналогічно вводяться на вкладці Ресурсы, рисунок 2.11 з вказівкою одиниць (кількості) задіяного ресурсу.
    """)

    rep.add_image("./Photos/ 10.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")
    rep.add_image("./Photos/ 11.png",
                  f"Рисунок {lr_number}.{++imagesNumber} – Вкладка Затраты діалогового вікна введення даних про ресурс")

    rep.append_text("""
    При проєктуванні розрізняють задачі й фази. Будь-яка задача автоматично стає фазою, як тільки в неї з'являється вкладена задача. Доти поки в задачі немає вкладених задач, вона не є фазою. Додавання в план фази нічим не відрізняється від додавання задачі. Щоб помістити 
    задачу на більше низький рівень структури, потрібно встановити курсор на рядок задачі і нажати на панелі інструментів
    форматування кнопка ‘–>’ або виконати щиглик правою кнопкою миші по номеру задачі й з контекстного меню вибрати команду На уровень ниже. Для
    переміщення задачі на попередній рівень структури потрібно нажати кнопку ‘<–‘, або у контекстному меню команда називається На уровень выше.
    """)

    rep.add_list(
        "Робота з таблицями в MS Project",
        """
        Таблиці – це один з основних способів подання проєктних даних. У проєктному файлі всі дані зберігаються у вигляді двох основних таблиць, одна йз яких містить інформацію про задачі, а друга - про ресурси проєкту, тобто задіяних виконанні задач людях і матеріальних цінностях. Ці таблиці вже були розглянуті і їх називають «внутрішніми» таблицями проєкту.
        Таблиці складаються з безлічі полів, які в більшості випадків не використовуються, тобто зарезервовані про запас. Деякі з них можуть бути задіяні при програмуванні, функціях аналізу проєкту тощо, але не потрібні при стандартному використанні MS Project.
        Також в MS Project закладений набір визначених таблиць, призначених для роботи з невеликим обсягом проєктної інформації, наприклад, таблиці трудовитрат, використання тощо. Ці таблиці називаються «зовнішніми» таблицями. Кожна із цих таблиць містить лише кілька полів однієї з «внутрішніх» таблиць проєктного файлу. Відповідно, «зовнішні» таблиці (як і «внутрішні») містять інформацію або про задачі, або про ресурси.
        """
    )

    rep.add_list(
        "Відображення, створення й видалення таблиць",
        """
        Таблиці відображаються в поданнях, причому є подання, у яких таблиці сполучені з діаграмою (наприклад, з діаграмою Ганта), а є й такі, котрі складаються з однієї таблиці (наприклад, ліст задач або ресурсів).
        Перемикання між таблицями здійснюється за допомогою команди меню Вид  Таблица.. Наприклад, для того щоб відобразити в поданні таблицю Использование задач, перейдіть до цього подання й виконайте Вид  Таблицы
        ¾	Использование задач, рисунок 2.12.
        """
    )

    rep.add_image("./Photos/ 12.png", f"Рисунок {lr_number}.{++imagesNumber} – Перемикання між таблицями проєкту")

    rep.append_text("""
    У списку, що з'являється при виборі команди Вид  Таблица, перераховані найбільше часто використовувані таблиці для поточного подання. Якщо ж у цьому списку немає потрібної таблиці, то її можна знайти, клацнувши по команді Другие таблицы. Після щиглика відкриється діалогове вікно зі списком всіх таблиць, доступних для відображення в поданнях MS Project, рисунок 2.13. Таблиці розділені на дві групи: Задачи й Ресурси, відповідно до типу відображуваної в них інформації, для вибору групи у верхній частині вікна є перемикач.
    """)

    rep.add_image("./Photos/ 13.png", f"Рисунок {lr_number}.{++imagesNumber} – Діалогове вікно «Другие таблицы»")

    rep.append_text("""
    Для того щоб потрібна таблиця відобразилася в поданні, досить вибрати її зі списку й нажати кнопку Применить. Але, MS Project не дозволяє додавати таблиці іншої групи, не відповідному поточному обраному поданню. При цьому кнопка Применить буде неактивна.
    Щоб створити таблицю, потрібно клацнути на кнопці Создать. При цьому з'явиться діалогове вікно визначення властивостей таблиці, у якому задається назва таблиці, склад її полів і їхній формат, а також додаткові параметри відображення таблиці.
    У	багатьох випадках таблиця створюється не «з нуля», а на основі існуючої таблиці. У цьому випадку краще скопіювати існуючу таблицю, зберігши її з новою назвою, і внести необхідні зміни. Для копіювання таблиці потрібно в діалоговому вікні Другие таблицы виділити в списку, що розкривається, потрібну таблицю й нажати кнопку Копировать. Після цього відкриється діалогове вікно визначення властивостей таблиці, поля якого будуть заповнені у відповідності із властивостями й структурою вихідної таблиці. Назва нової таблиці буде змінена на Копія_назва_вихідної_таблиці й буде скинутий прапорець Показывать в меню.
    Для видалення таблиці в діалоговому вікні Другие таблицы клацніть по кнопці Организатор, рисунок 2.14. У правій частині виділите назву потрібної таблиці й натисніть кнопку Удалить.
    """)

    rep.add_image("./Photos/ 14.png", f"Рисунок {lr_number}.{++imagesNumber} – Діалогове вікно «Другие таблицы»")

    rep.add_list(
        "Редагування таблиць, сортування й фільтрація даних",
        """
        У	будь-якої таблиці, що входить в MS Project, є стандартний набір стовпців, що не завжди може підходити до даному проєкту. У цьому випадку його можна змінити.
        Щоб додати стовпець у таблицю, відкрийте її й виконайте Вставка  Столбец (стовпець вставиться перед тим стовпцем, у якому стояв курсор). Після цього відкривається діалогове вікно визначення властивостей цього стовпця, рисунок 2.15. Поле Имя поля містить список полів, які можна додати в таблицю (поля з «внутрішньої» таблиці). Якщо ви хочете, щоб стовпець називався по-іншому, то впишіть іншу назву в поле Текст заголовка. Якщо клацнути по кнопці Автоширина, то при цьому автоматично підбирається оптимальна ширина стовпця, що додається (при цьому раніше задана ширина в полі Ширина ігнорується).
        Щоб видалити непотрібний стовпець, виділите його, клацнувши на його заголовку, а потім у контекстному меню стовпчика виберіть команду Скрыть столбец або натисніть клавішу Delete.
        """
    )

    rep.add_image("./Photos/ 15.png", f"Рисунок {lr_number}.{++imagesNumber} – Діалогове вікно «Другие таблицы»")

    rep.append_text("""
    Для редагування даних у таблицях застосовуються майже такі ж прийоми роботи, як і в Excel.
    Якщо потрібно заповнити даними одного осередку кілька інших осередків таблиці, то треба виконати наступні дії:
    Виділити осередок з вихідною інформацією, потім, утримуючи клавішу Ctrl, виділити ті осередки, які необхідно заповнити (осередки повинні бути в одному стовпці!);
    Виконати команду Правка  Заполнить  вибрати напрямок заповнення.
    Якщо осередок перебуває безпосередньо під вихідним осередком, то для заповнення можна скористатися прийомом автозаповнення Excel: виділити вихідний осередок, установити покажчик миші на чорний квадратик у правому нижньому куті осередку. Потім, утримуючи ліву кнопку миші, потягнути квадратик у напрямку заповнюваних осередків.
    Для видалення даних з таблиці служить клавіша Delete. Якщо виділити весь рядок і нажати Delete, то рядок буде вилучений.
    Дані таблиці для зручності пошуку можна сортувати. Для цього відкрийте таблицю й виконайте Проект  Сортировка. У підменю цієї команди список команд різний і залежить від того, з якою таблицею ви в цей момент працюєте. Останній пункт у списку Сортировать по викликає вікно сортування, у якому можна настроїти параметри сортування самостійно. Цей пункт присутній у списку завжди. Цю команду можна використати для складного сортування по декількох критеріях. Можна вибрати до трьох полів сортування. Сортування виконується послідовно: спочатку по першому полю, потім по другому й потім - по третьому. 
    Якщо в таблиці багато інформації, то для її пошуку можна використати відбір потрібної інформації – фільтрацію. Найпоширеніший інструмент – це Автофільтр.
    Для включення автофільтра можна нажати кнопку Автофильтр  на панелі інструментів або виконати команду Проект  Фильтр  Автофильтр. При включенні режиму в заголовку кожного стовпчика з'являються кнопки, за допомогою яких можна задати умови фільтрації рядків у таблиці. При натисканні кнопки розкривається меню, що дозволяє визначити значення або список значень, які повинен містити стовпчик. Після вибору такого значення в таблиці відображаються тільки ті рядки, у яких стовпчик містить певне значення. Також зі списку, що розкривається, можна використати команду Условие. 
    Щоб скасувати фільтрацію по одному зі стовпців потрібно ввійти в меню автофільтра, клацнувши на заголовку стовпця, і вибрати в ньому пункт Усе. Для скасування фільтрації по всіх стовпцях потрібно виключити автофільтр. Вимикання відбувається тим же способом, що й включення.
    """)

    # add_images_of_all_files(report, lr_number, "Photos")

    rep.add_lab_conclusion("Висновок: ознайомився з інформаційною системою  MASTER:Бухгалтерія.")
    rep.save()
