from config import *
import warnings
from ReportBuilder import ReportBuilder

warnings.filterwarnings("ignore", category=UserWarning, module="docx")

if __name__ == "__main__":
    report = ReportBuilder("ВТП Фамилия.docx", start_section_number)

    # ВСТУП

    report.add_introduction(f"""
Процес проходження виробничої практики є суттєвим етапом підготовки студентів до реальної роботи за обраною спеціальністю. Він дає можливість застосувати теоретичні знання в практичній діяльності, а також здобути важливі професійні навички, необхідні для подальшої кар'єри. Практика дозволяє оцінити власний рівень підготовки, перевірити правильність вибору професійного напряму та глибше зрозуміти специфіку роботи в конкретній галузі.
Протягом практики студенти мають змогу вирішувати реальні робочі завдання, працювати в команді, приймати самостійні рішення та обґрунтовувати свої висновки. Хоча на початковому етапі молодим фахівцям не часто доручають виконання складних проектів, участь у повсякденних завданнях сприяє розвитку їх професійних навичок. Це дає можливість швидше адаптуватися до робочих умов і розвивати вміння працювати в колективі.
Особлива увага приділяється навчанню таких компетенцій, як дотримання корпоративних стандартів, розвиток навичок ефективної комунікації та взаємодії з керівниками і колегами. Вирішення практичних завдань допомагає студентам краще усвідомити вимоги до професіоналів у їхній сфері діяльності.
Процес організації практики базується на чинних нормах законодавства, зокрема на законах України «Про вищу освіту» [{add_source(r"Закон України «Про вищу освіту» https://zakon.rada.gov.ua/laws/show/1556-18")}], «Про фахову передвищу освіту» [{add_source(r"Закон України «Про фахову передвищу освіту» https://zakon.rada.gov.ua/laws/show/2745-19")}], а також на наказі Міністерства освіти і науки України №1006 від 21.09.2021 [{add_source(r"Наказ МОН України №1006 від 21.09.2021 https://osvita.ua/legislation/faxova-peredvyshha-osvita/85816/")}]. Ці нормативні акти визначають стандарти підготовки студентів за спеціальністю 121 «Інженерія програмного забезпечення» і закріплюють обов'язковість проходження практики для всіх студентів, які успішно освоїли навчальний план.
Виробнича практика проводиться на базі Відокремленого структурного підрозділу «Фаховий коледж ракетно-космічного машинобудування Дніпровського національного університету імені Олеся Гончара».
""")

    # Правила охорони праці та техніки безпеки на підприємстві

    report.add_section("Правила охорони праці та техніки безпеки на підприємстві")

    report.add_sub_section(
        "Аналіз небезпечних та шкідливих виробничих чинників проєктованого технологічного процесу, об’єкту, системи або пристрою")
    report.add_text(f"""
Процес розробки програмного продукту є комплексним і вимагає багатьох етапів, що включають проектування системної архітектури, програмування, тестування та підготовку документації. Всі ці роботи виконуються в спеціально облаштованих приміщеннях, які мають необхідне обладнання для ефективної діяльності. Важливою частиною розробки є правильна організація робочого простору, оскільки при роботі з комп'ютерною технікою можуть виникати фізичні та психофізіологічні ризики для працівників.
Основною небезпекою є електричні ризики. Використання електричних пристроїв, таких як комп'ютери, зарядні пристрої та мережеві адаптери, пов'язане з можливими небезпеками, включаючи коротке замикання або несправності обладнання, що може призвести до травм. Тому важливо постійно перевіряти стан електричних мереж та пристроїв і вживати заходів для їх захисту від можливих проблем.
Шум і вібрація, що виникають при роботі охолоджувальних систем та вентиляторів у комп'ютерних системах, можуть спричиняти дискомфорт при тривалому впливі. У великих офісах, де використовуються кілька пристроїв одночасно, рівень шуму і вібрацій може стати відчутним і впливати на комфорт працівників. Тому при плануванні робочого простору важливо враховувати ці фактори, використовуючи технології, що знижують рівень шуму і системи охолодження з низьким рівнем вібрацій.
Метеорологічні умови та освітлення на робочому місці мають прямий вплив на ефективність праці. Недостатнє або надмірне освітлення може викликати втомленість і зорове напруження, що знижує продуктивність. Відсутність належної вентиляції може підвищити температуру в приміщенні, що погіршує самопочуття працівників та знижує їх ефективність. Тому важливо створити оптимальні умови освітлення та вентиляції для забезпечення комфортної роботи [{add_source(r"Вимоги до організації та обслуговування робочого місця https://studfile.net/preview/5437414/page:10/")}].

""")

    report.add_sub_section("Інженерно-технічні заходи з охорони праці")
    report.add_text(f"""
Створення безпечних умов праці при розробці програмного забезпечення є важливим аспектом, що забезпечує не лише здоров'я працівників, але й ефективність їхньої роботи. Ключовим напрямком є застосування автоматизованих систем для контролю технологічних процесів, що дозволяє оперативно виявляти аварійні ситуації на ранніх етапах. Такі технології здійснюють моніторинг електричних систем, апаратного забезпечення та інших технічних засобів, що дозволяє забезпечити їхню надійну і безпечну експлуатацію. Крім того, до важливих складових захисту належать сигналізація, засоби аварійного вимкнення та захисту, що дозволяють швидко реагувати на можливі загрози.
Також важливо забезпечити належні метеорологічні умови в робочих приміщеннях. Для цього використовуються кондиціонери, які контролюють температуру та вологість повітря, що сприяє комфортній атмосфері для працівників. Очищення повітря від пилу і шкідливих часток здійснюється за допомогою спеціалізованих фільтрів і пиловловлювачів. Це дозволяє знизити ризики захворювань дихальних шляхів і алергічних реакцій, створюючи сприятливі умови для здоров’я працівників.
Особливою увагою потребує зниження рівня електромагнітних випромінювань, які можуть негативно впливати на здоров’я співробітників. Для цього використовуються низьковипромінюючі монітори та оптимізується розташування комп'ютерного обладнання. Це дозволяє знизити негативний вплив електромагнітних полів на організм. Також важливо зменшувати рівень шуму та вібрацій, що виникають від охолоджувальних систем. Для цього застосовуються безшумні вентилятори та спеціальні звукоізоляційні матеріали.
Організація робочого простору програміста повинна враховувати не лише технічні аспекти, але й ергономічні вимоги. Використання регульованих меблів, таких як столи та крісла, зменшує навантаження на опорно-руховий апарат і сприяє правильній поставі. Освітлення має відповідати санітарним вимогам для захисту зору, а також повинно бути передбачене аварійне освітлення для випадку відключення електроенергії. Усі ці заходи забезпечують не лише комфортні умови праці, але й сприяють високій продуктивності працівників [{add_source(r"Інженерно-технічні заходи з охорони праці https://studfile.net/preview/8968088/page:3/")}].
""")

    report.add_sub_section("Пожежна профілактика")
    report.add_text(f"""
У процесі розробки програмного забезпечення надзвичайно важливо забезпечити належний рівень пожежної безпеки в робочих приміщеннях. Одним із основних факторів ризику є використання електричних пристроїв і проводки, які можуть стати причиною пожежі через перегрів або коротке замикання. Для зменшення цих загроз потрібно регулярно перевіряти стан електричних мереж і використовувати блоки живлення з функцією захисту від короткого замикання. Також слід застосовувати кабелі з негорючими матеріалами, що мінімізує ризик загоряння.
Ще однією важливою складовою є наявність системи пожежної сигналізації. Встановлення димових датчиків дозволяє своєчасно виявити початок загоряння і передати сигнал на пульт охорони, що дає можливість швидко реагувати на небезпеку та запобігти її поширенню. Ці заходи є невід'ємною частиною забезпечення безпеки в приміщеннях, де використовуються великі обсяги електронного обладнання.
Додатково для підвищення рівня пожежної безпеки в офісах варто оснащувати приміщення вогнегасниками, здатними ефективно гасити пожежі в електричному обладнанні під напругою. Вуглекислотні та порошкові вогнегасники мають бути доступними в приміщеннях, де зберігається техніка. Для площ до 50 м² рекомендовано наявність принаймні двох вогнегасників. Також необхідно мати протипожежні покривала для оперативного гасіння малих загорянь, що можуть виникнути під час роботи.
Крім технічних засобів безпеки, не менш важливо розробити чітко визначені евакуаційні плани. Вони повинні включати позначення виходів та шляхів евакуації, що дозволяє співробітникам швидко і безпечно залишити приміщення у випадку надзвичайної ситуації. Крім того, має бути налаштована система аварійного освітлення, яка дозволяє забезпечити видимість під час відключення електропостачання. Проведення тренінгів для співробітників щодо основ пожежної безпеки та правильного використання вогнегасників значно знижує ризики та підвищує рівень готовності до непередбачених ситуацій [{add_source(r"Пожежна профілактика на робочому місці https://ohoronapraci.kiev.ua/article/news/pozezna-bezpeka-na-robocomu-misci")}].
""")

    report.add_sub_section("Заходи з ергономіки")
    report.add_text(f"""
Однією з головних причин травм на робочому місці є психофізіологічні фактори, такі як стрес, перевантаження та неправильні реакції на зовнішні стимули. Для зменшення їхнього впливу на працівників під час розробки програмного забезпечення застосовано ряд заходів, спрямованих на забезпечення безпеки та зручності. Важливим компонентом є ергономіка робочого простору: застосування меблів з можливістю регулювання, правильне розташування моніторів і м'яке освітлення, що допомагає знижувати фізичне навантаження і сприяє збереженню концентрації.
Також велике значення має організація простору без відволікань, таких як зайві предмети або надмірний шум. Це дозволяє створити умови для високої продуктивності. Важливо, щоб усі необхідні інструменти, такі як клавіатура, миша та інші аксесуари, були завжди під рукою, що допомагає уникати зайвих рухів і знижує втому.
Забезпечення комфортних умов праці значно знижує рівень стресу, що, в свою чергу, позитивно впливає на продуктивність та здоров'я співробітників. Не менш важливою є організація регулярних перерв для фізичних вправ, які сприяють зняттю напруги і підтримці фізичного та психічного здоров'я. Крім того, необхідно проводити навчання співробітників щодо ергономіки та правильного використання робочих місць, що допомагає мінімізувати негативний вплив стресових ситуацій на їхню діяльність.
У загальному підсумку, добре організоване робоче середовище сприяє підвищенню ефективності праці і зниженню ймовірності виникнення травм. Врахування ергономічних аспектів, зниження рівня стресу та створення комфортних фізичних умов є важливими складовими успішної роботи та розробки програмного забезпечення [{add_source(r"Заходи з ергономіки https://studfile.net/preview/9919354/page:9/")}].
""")

    # Характеристика підприємства

    report.add_section("Характеристика підприємства")

    report.add_sub_section("Загальна характеристика навчального закладу")
    report.add_text(f"""
Коледж розпочав свою діяльність 25 жовтня 1944 року, коли був заснований як Дніпропетровський автомеханічний технікум згідно з постановою Народного Комісара середнього машинобудування СРСР від 31 липня 1944 року. Його метою була підготовка кадрів для майбутнього автомобільного заводу в Дніпропетровську.
Першим директором був Дмитро Іванович Шандра, а завідуючою навчальною частиною – Віра Харлампієвна Шаповалова, які організували приймальну комісію. Спочатку технікум працював в школі №81, а пізніше отримав приміщення ремісничого училища.
У 1946 році було створено 11 навчальних кабінетів, а також відкрито перші навчально-виробничі майстерні. До 1947 року підготовка проводилася за спеціальностями: ковальське і ливарне виробництво, холодна обробка металів, інструментальне виробництво та збирання автомашин. У 1947 році відбувся перший випуск спеціалістів.
31 липня 1947 року технікум очолив Назарій Омелянович Клебанський. Було відкрито вечірнє відділення та введено спеціальність „Електрообладнання промислових підприємств”. З 1951 року технікум змінив профіль на підготовку фахівців у галузі ракетно-космічної техніки.
Після реконструкції в 1951 році навчальні будівлі були оснащені актовим залом, електротехнічною лабораторією та спеціалізованими кабінетами. Також були введені нові спеціальності: двигуни літальних апаратів, корпуси літальних апаратів, прилади та системи управління.
У 1962 році технікум переїхав до нового корпусу на вулиці Більшовицькій. До кінця 1960-х років були побудовані навчально-виробничий корпус та гуртожиток, створено кабінети та лабораторії для спеціальності „Експлуатація та наладка верстатів з програмним управлінням”.
З 1970-х років у технікумі активно впроваджувалися новітні технології: навчальні електронні обчислювальні машини, програмовані верстати та лабораторії автоматизації. У 1981 році було завершено будівництво нового навчального корпусу площею понад 3000 м².
У 1991 році технікум отримав нову назву — Дніпропетровський технікум ракетно-космічного машинобудування, і увійшов до складу Дніпропетровського національного університету. З 1997 року навчальний заклад здобув статус коледжу.
На сьогодні коледж продовжує підготовку фахівців у галузі машинобудування, ракетно-космічної техніки та суміжних спеціальностей, активно запроваджує інноваційні освітні технології та співпрацює з провідними підприємствами галузі [{add_source(r"Загальна характеристика навчального закладу https://dkrkm.org.ua")}].
""")

    report.add_sub_section("Організаційна структура підприємства")

    report.add_image("Організаційно-штатна структура закладу.jpg", "Організаційно-штатна структура закладу")

    report.add_sub_section("Обов’язки посадових осіб закладу")

    report.add_sub_sub_section("Посадові обов’язки директора коледжу")
    report.add_text(f"""
Директор навчального закладу є головною посадовою особою, відповідальною за стратегічне управління та координацію діяльності навчального закладу, а також за його успішну роботу перед засновниками та державними органами. Основне завдання директора — створення умов для високоякісного навчання, виховання та професійного розвитку студентів і колективу, відповідно до державних стандартів освіти.
Однією з основних функцій є організація роботи педагогічного колективу, яка включає призначення викладачів, завідувачів відділень, заступників, а також формування кадрової політики. Директор має забезпечити відповідність освітніх програм сучасним вимогам, впроваджувати інноваційні технології, підтримувати партнерські зв'язки з іншими навчальними закладами, підприємствами та міжнародними організаціями.
Директор відповідає за складання бюджету, розподіл фінансових ресурсів, організацію тендерів, контроль за виконанням кошторису та розвиток матеріально-технічної бази закладу. Його завданням є забезпечення належного рівня інфраструктури, зокрема, оснащення навчальних аудиторій, лабораторій, майстерень та спортивних залів сучасним обладнанням.
Окрім адміністративних обов'язків, директор виконує роль представника навчального закладу у зовнішньому середовищі: бере участь у нарадах, конференціях, форумах, встановлює ділові контакти, відстоює інтереси студентів та колективу в державних органах влади. Він також організовує моніторинг якості освіти, аналізує результати роботи закладу та впроваджує корективи для покращення показників.
Особлива увага приділяється питанням безпеки студентів та працівників, розробці заходів із запобігання надзвичайним ситуаціям, забезпеченню охорони праці, а також створенню сприятливого морально-психологічного клімату в колективі. Директор несе повну відповідальність за виконання законодавчих норм у сфері освіти, підготовку звітної документації, а також організацію підготовки закладу до акредитаційних перевірок та аудиту [{add_source(r"Посадові обов’язки директора коледжу https://npu.edu.ua/images/file/viddil_kadriv/dyrektor_VPU.pdf")}].
""")

    report.add_sub_sub_section("Посадові обов’язки заступника директора з навчальної роботи коледжу")
    report.add_text(f"""
Заступник директора з навчальної роботи є ключовою посадовою особою, відповідальною за організацію навчального процесу, його якість та відповідність актуальним освітнім стандартам. Основне завдання цієї посадової особи — розробка, впровадження та контроль за виконанням навчальних планів, програм і розкладів занять.
Заступник відповідає за координацію діяльності викладачів, сприяє підвищенню їх кваліфікації, організовує методичні семінари, конференції та педагогічні ради. Важливою частиною роботи є впровадження сучасних методів навчання, таких як інтерактивні заняття, проектний підхід і дистанційні технології. Заступник активно підтримує інновації, залучає викладачів до створення електронних навчальних матеріалів, організовує курси для підвищення кваліфікації.
Однією з основних функцій є контроль за відвідуваністю та успішністю студентів. Заступник аналізує навчальні результати, вживає заходів для поліпшення академічної підготовки, дає рекомендації щодо усунення прогалин у знаннях. Він також координує взаємодію між студентами, викладачами та батьками з питань навчальної діяльності.
Крім того, важливим напрямом є підготовка до атестацій, акредитацій та ліцензування спеціальностей. Заступник забезпечує якісне складання документації та створює умови для проходження закладом всіх необхідних перевірок. Ця посадова особа також займається моніторингом освітніх тенденцій та адаптацією навчальних програм до потреб ринку праці [{add_source("Посадові обов’язки заступника директора з навчальної роботи коледжу https://kkht.dp.ua/wp-content/uploads/2019/06/Заступника-директора-з-НР.pdf")}].
""")

    report.add_sub_sub_section("Посадові обов’язки заступника директора з навчально-виробничої роботи коледжу")
    report.add_text(f"""
Заступник директора з навчально-виробничої роботи є відповідальним за взаємодію між навчальним процесом та виробничими практиками, організацію навчальних і виробничих процесів в межах коледжу. Його завдання включають розробку програм виробничої практики, взаємодію з підприємствами та організаціями для забезпечення студентів місцями для практики.
Основною функцією є контроль за проведенням навчальних та виробничих практик, а також моніторингом їх ефективності та результативності. Заступник активно співпрацює з підприємствами, розвиваючи нові можливості для працевлаштування випускників та покращення практичного досвіду студентів.
Важливою частиною його роботи є організація атестацій і сертифікацій для студентів, проведення моніторингу результатів виробничих практик та аналіз потреб у вдосконаленні навчальних планів. Заступник також займається вдосконаленням навчальних і виробничих програм відповідно до вимог ринку праці [{add_source("Посадові обов’язки заступника директора з виробничої роботи https://hpslsamoilova.blogspot.com/p/blog-page_11.html")}].
""")

    report.add_sub_sub_section("Посадові обов’язки заступника директора з адміністративно-господарської роботи коледжу")
    report.add_text(f"""
Заступник директора з адміністративно-господарської роботи відповідає за збереження та розвиток матеріально-технічної інфраструктури навчального закладу, гарантування відповідності умов для навчання і роботи чинним стандартам безпеки, санітарії та технічним вимогам. Головною метою є забезпечення оптимальних умов для учнів та працівників, з урахуванням усіх аспектів їх діяльності.
Основною функцією є моніторинг стану будівель, лабораторій, аудиторій, спортивних об'єктів і гуртожитків, а також координація роботи всіх підрозділів, які відповідають за збереження закладу в належному стані. Заступник організовує роботу технічного персоналу, що включає спеціалістів з прибирання, охорони, обслуговування електрики та сантехніки.
Завдання також включають складання планів щодо ремонтів та контролю за їх виконанням, організацію закупівлі необхідних матеріалів, а також забезпечення енергоефективності та раціонального використання ресурсів. Особлива увага приділяється забезпеченню безпеки, включаючи навчання з питань пожежної безпеки та технічних стандартів.
У числі інших обов’язків — організація роботи з інвентаризації майна, підготовка документації для перевірок та аудитів, співпраця з підрядниками [{add_source("Посадові обов’язки заступника директора з адміністративно-господарської роботи коледжу https://kkht.dp.ua/wp-content/uploads/2019/06/Поcадова-заступника-директора-з-АГР-2019.pdf")}].
""")

    report.add_sub_sub_section("Посадові обов’язки завідувача відділенням коледжу")
    report.add_text(f"""
Завідувач відділенням здійснює керівництво навчальним процесом та адміністративною діяльністю структурного підрозділу, відповідаючи за забезпечення якості навчання та ефективну роботу викладачів. Він організовує планування та реалізацію навчальних програм і розкладів занять.
Завідувач виконує функції контролю за успішністю студентів, організовує атестації, сприяє підвищенню дисципліни та якості знань серед учнів. Усі питання, що стосуються академічної заборгованості студентів, також знаходяться під його контролем, і він розробляє стратегії для покращення успішності.
Завідувач відділенням відповідає за організацію професійного розвитку викладачів, проводить семінари та курси підвищення кваліфікації для персоналу. Також він активно реалізує інноваційні методи навчання та організовує створення нових навчальних матеріалів.
Ця посадова особа забезпечує співпрацю з підприємствами та іншими установами для практичного навчання студентів, а також займається підготовкою професійних звітів і організацією заходів з профорієнтації [{add_source("Посадові обов’язки завідувача відділенням коледжу https://profpressa.com/instructions/zaviduvach-viddilennia-u-koledzhi")}].
""")

    report.add_sub_sub_section("Посадові обов’язки викладача коледжу")
    report.add_text(f"""
Викладач є важливим елементом освітнього процесу, який відповідає за організацію навчання, розвиток та виховання студентів. Його основне завдання — забезпечення навчання, яке сприяє розвитку ключових знань та навичок, необхідних студентам для професійної діяльності в майбутньому.
Викладач проводить лекції, семінари, практичні та лабораторні заняття, розробляє навчальні матеріали, організовує тести та завдання для самостійної роботи, а також займається оцінюванням знань студентів. Важливим аспектом його діяльності є індивідуальний підхід до студентів, пояснення складних тем і підтримка їх мотивації до навчання.
Однією з важливих функцій викладача є оцінювання студентських знань через різні форми: контрольні роботи, тести, заліки та екзамени. Викладач бере участь у розробці навчальних планів і програм, а також інтегрує новітні методи та інформаційні технології в навчальний процес.
Важливою частиною роботи викладача є виховний процес, що включає формування у студентів відповідальності, поваги до законів і моральних принципів, а також участь у позанавчальних заходах. Викладач також надає консультації студентам з освітніх та особистих питань.
Регулярне підвищення кваліфікації через участь у семінарах, тренінгах і конференціях є важливою складовою його професійного розвитку. Його діяльність має безпосередній вплив на рівень підготовки студентів та на престиж навчального закладу [{add_source("Посадові обов’язки викладача коледжу https://npu.edu.ua/images/file/viddil_kadriv/vykladach.pdf")}].
""")

    # Практика на робочому місці

    report.add_section("Практика на робочому місці")

    report.add_sub_section("Календарні терміни виконання завдань")
    data_for_first_week = """
– проведено аналіз небезпечних та шкідливих чинників проєктованого технологічного процесу, об’єкту, системи та пристроїв;
– пройдено інструктаж з інженерно-технічних заходів з охорони праці;
– пройдено інструктаж з пожежної профілактики;
– пройдено інструктаж із заходів з ергономіки;
– ознайомлено з діяльністю коледжу;
– ознайомлено із структурою коледжу;
– ознайомлено з обов’язками посадових осіб коледжу;
– пройдено інструктаж з інтрументами розробки (Vim, Clang, CMake);
– аналіз алгоритмів необхідних для написання проекту;
– розробка необхідних утиліт для роботи з файлами;
– відлагодження та тестування перших написаних компонентів проекту.
"""

    data_for_second_week = """
– аналіз помилок пам’яті (buffer overflow, memory leaks);
– освоєння принципів побудови власних бібліотек;
– вивчення стандартів офорлмення коду clang-format;
– розробка основної логіки проекту;
– інтеграція утиліт з основною програмою.
"""

    data_for_third_week = """
– тестування та відлагодження інтегрованих компонентів;
– аналіз та виправлення помилок, виявлених під час тестування;
– перевірка функціональності на різних етапах реалізації;
– початкова перевірка проекту на відповідність вимогам;
– завершення основної розробки програмного забезпечення;
– остаточне тестування та виправлення помилок.
"""

    data_for_fourth_week = """
– підготовка звіту про виконану роботу;
– підготовка проекту до захисту;
– проведення фінальних перевірок відповідності проекту вимогам;
– написання документації до проєкту;
– оформлення звіту за результатами проходження практики.
"""

    report.add_table("Графік проходження практики", [
        ['Тиждень', 'Виконана робота'],
        ['1', data_for_first_week.strip()],
        ['2', data_for_second_week.strip()],
        ['3', data_for_third_week.strip()],
        ['4', data_for_fourth_week.strip()],
    ])

    report.add_sub_section("Характеристика технічного і програмного обладнання робочого місця")
    report.add_list(f"""
Під час проходження практики використовується ноутбук Dell Latitude 5490, який має наступні технічні характеристики

процесор: Intel Core i5-8250U
дисплей: 14-дюймовий дисплей Full HD
об’єм оперативної пам’яті: 8 ГБ
об’єм пам’яті дисків: SSD 256 ГБ
графічна карта: Intel UHD Graphics 620
""")

    report.add_sub_section("Засоби дистанційного навчання в малих групах")
    report.add_text(f"""
Під час проходження практики були застосовані методи організації роботи малих груп у дистанційному форматі для ефективного навчання та співпраці між учасниками.
""")
    report.add_list(f"""
Для організації роботи малих груп було вибрано наступні інструменти:

- Платформа для обговорень: Slack — для забезпечення комунікації між учасниками групи та обміну інформацією в реальному часі
- Система керування версіями коду: GitHub — для зберігання, обміну та колективної роботи над проектами та кодом
""")
    report.add_list(f"""
Організація малих груп дозволила досягти наступних результатів:

- Покращення залучення учасників до навчального процесу, забезпечуючи більшу активність
- Швидке виявлення проблем у розумінні матеріалу завдяки взаємодії з одногрупниками
- Розвиток командної роботи та обміну знаннями серед учасників групи
""")
    report.add_text("""
Основними факторами успіху в роботі малих груп стали ефективна комунікація між учасниками, використання сучасних технологій та регулярний зворотний зв’язок від викладачів. Це дозволило покращити якість освітнього процесу та спростило вирішення практичних завдань під час практики.
""")

    report.add_sub_sub_section("Біль детальніше про Slack")
    report.add_text(f"""
Slack — це популярна платформа для комунікації та співпраці, що забезпечує реальний час для організації робочих процесів в командах. Вона дозволяє ефективно організовувати обговорення, обмінюватися файлами і проводити відеоконференції, що підвищує продуктивність команди. Slack інтегрується з багатьма інструментами, такими як Google Drive, GitHub, Trello та інші, що робить її потужним інструментом для командної роботи. 
Платформа також забезпечує зручне використання тематичних каналів для обміну інформацією, що дозволяє зберігати важливі дані в структурованому вигляді, доступному для всіх учасників проекту [{add_source("Інтеграції Slack https://slack.com/integrations")}].
""")
    report.add_list(f"""
Основні функції Slack:

- обмін повідомленнями в реальному часі
- створення каналів для різних проектів та тем
- інтеграція з іншими сервісами (Google Drive, GitHub, Trello)
- організація відео- та голосових дзвінків
- завантаження документів і файлів
- пошук по історії повідомлень
- реакції на повідомлення через смайли
- автоматизація через боти та команди
""")
    report.add_list(f"""
Переваги використання Slack для учасників:

- доступ до спеціалізованих каналів для обговорення проектів
- можливість обміну файлами та документацією
- організація відео- та голосових дзвінків для швидких обговорень
- забезпечення швидкої та ефективної комунікації серед учасників
- інтеграція з іншими інструментами для покращення роботи над проектами
- можливість задавати питання та отримувати зворотний зв'язок від колег та керівників
- доступ до історії повідомлень для пошуку потрібної інформації
""")

    report.add_sub_sub_section("Біль детальніше про GitHub")
    report.add_text(f"""
GitHub — це популярна платформа для зберігання коду, що підтримує систему контролю версій Git [{add_source("GitHub https://github.com/home")}]. Вона дає змогу розробникам зберігати проекти в репозиторіях, співпрацювати з колегами, обговорювати зміни в коді та інтегруватися з іншими інструментами для автоматизації розробки. GitHub забезпечує зручну командну роботу завдяки таким функціям, як створення pull requests, перегляд коду та моніторинг змін і версій [{add_source("GitHub Collaborating with pull requests https://docs.github.com/en/github/collaborating-with-issues-and-pull-requests")}]. Платформа активно використовується в навчальних закладах та організаціях для навчання студентів основам програмування та контролю версій
""")
    report.add_list(f"""
Основні функції GitHub:

- створення і керування репозиторіями для збереження коду [{add_source("GitHub Repositories https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/creating-a-new-repository")}]
- контроль версій проекту та історії змін [{add_source("Git Version Control https://git-scm.com/book/en/v2/Getting-Started-About-Version-Control")}]
- створення та перегляд pull requests для колективної роботи [{add_source("GitHub Pull Requests https://docs.github.com/en/github/collaborating-with-issues-and-pull-requests/about-pull-requests")}]
- проведення обговорень і коментування коду
- інтеграція з CI/CD системами для автоматизованого тестування
- відстеження задач і помилок через Issues [{add_source("GitHub Issues https://docs.github.com/en/github/managing-your-work-on-github/about-issues")}]
""")
    report.add_list(f"""
У середовищі GitHub студенти можуть:

- зберігати і управляти своїми проектами
- працювати з іншими студентами над спільними репозиторіями
- користуватися інструментами для контролю версій і зміни коду
- коментувати та переглядати код інших учасників
- відновлювати попередні версії проекту завдяки історії змін
- налаштовувати автоматичне тестування та перевірку коду
- спільно працювати над документацією і проектними матеріалами
""")

    report.add_section("ВИКОНАННЯ ІНДИВІДУАЛЬНОГО ЗАВДАННЯ")

    report.add_sub_section("Програмне забезпечення")

    report.add_sub_sub_section("Ubuntu")
    report.add_text(f"""
Ubuntu — це одна з найбільш відомих операційних систем на основі Linux, яка набуває популярності серед розробників завдяки своїй простоті та великій кількості інструментів для програмування. Ця система включає безліч бібліотек, компіляторів та інших необхідних утиліт, що робить її ідеальною для створення програмного забезпечення. [{add_source("Ubuntu https://ubuntu.com/about")}]
""")

    report.add_sub_sub_section("Vim")
    report.add_text(f"""
Vim — це надзвичайно ефективний текстовий редактор, що використовується для програмування, редагування файлів і налаштування конфігурацій. Цей редактор побудований на основі старого Vi і спроектований для оптимізації процесу роботи з кодом через використання команд і макросів. Завдяки численним плагінам та можливості інтеграції з іншими інструментами, Vim є потужним інструментом, що забезпечує високу швидкість і гнучкість роботи. [{add_source("Vim https://www.vim.org")}]
""")
    report.add_list(f"""
Функціональні можливості Vim включають:
- підтримка численних мов програмування, таких як C, C++, Python, Java, JavaScript, Ruby і багатьох інших [{add_source("Vim Documentation https://www.vim.org/docs.php")}]
- можливість тонкої настройки через конфігураційні файли (vimrc) [{add_source("Vimrc Configuration https://vim.fandom.com/wiki/Vimrc")}]
- інтеграція з системами контролю версій (Git) через плагіни [{add_source("Vim Git Integration https://www.vimfromscratch.com/articles/using-git-from-vim")}]
- використання регулярних виразів для пошуку і заміни тексту [{add_source("Vim Regular Expressions https://vim.fandom.com/wiki/Regular_expressions")}]
- розширена функціональність для роботи з макросами та командним редагуванням [{add_source("Vim Documentation https://www.vim.org/docs.php")}]
- підтримка обробки великих файлів [{add_source("Vim Documentation https://www.vim.org/docs.php")}]
- можливість роботи з кількома файлами одночасно завдяки використанню вкладок [{add_source("Vim Documentation https://www.vim.org/docs.php")}]
- інтеграція з компіляторами та інструментами для налагодження коду [{add_source("Vim Documentation https://www.vim.org/docs.php")}]
""")

    report.add_sub_sub_section("Clang")
    report.add_text(f"""
Clang — це компілятор для мов C, C++ і Objective-C, який є частиною проекту LLVM. Він відомий своєю швидкістю компіляції та розвиненими інструментами для діагностики помилок, оптимізації коду та інших задач, що важливі для розробників. [{add_source("Clang Compiler https://clang.llvm.org/")}]
""")

    report.add_sub_sub_section("CMake")
    report.add_text(f"""
CMake — це кросплатформенний інструмент, який автоматизує процес побудови програмного забезпечення. Він дозволяє генерувати файли компіляції, враховуючи особливості різних операційних систем, що робить його ідеальним вибором для великих і складних проектів. [{add_source("CMake Documentation https://cmake.org/documentation/")}]
""")

    report.add_sub_section("Опис проєкту")
    report.add_text(f"""
Метою цього проєкту є створення системи управління файлами, яка включатиме в себе набір функцій для збереження, перевірки та організації файлів в певних каталогах, а також для обробки помилок, що можуть виникнути в процесі роботи з файлами. Система має працювати на мові програмування C і включати в себе модулі для роботи з метаданими та утилітами для обробки файлів
""")

    report.add_sub_section("Постановка завдання")
    report.add_list(f"""
Модуль управління файлами (file_storage):
    Створення функцій для роботи з файлами, таких як перевірка наявності файлів, збереження нових файлів, створення директорій та видалення файлів.
    Функції повинні забезпечувати унікальні імена для файлів при їх збереженні, щоб уникнути перезапису існуючих файлів.
    Модуль має включати обробку помилок, що можуть виникнути під час роботи з файлами, таких як відсутність файлів або прав на доступ.
Модуль обробки помилок (file_storage_errors):
    Реалізація функцій для обробки та виведення помилок при виконанні операцій з файлами, наприклад, неуспішне створення директорії чи відсутність потрібного файлу.
Модуль метаданих (metadata):
    Створення функцій для обробки метаданих файлів, наприклад, зчитування розміру, дати створення, модифікації та інших атрибутів файлів.
Утиліти (utils):
    Реалізація допоміжних функцій для полегшення роботи з файлами та метаданими, наприклад, генерація унікальних імен для файлів чи обробка різних форматів даних.
Тести (tests):
    Реалізація набору тестів для перевірки коректності роботи всіх модулів.
    Тести повинні перевіряти основні функціональні можливості, такі як створення/видалення файлів, перевірка коректності збереження файлів з унікальними іменами, а також правильність обробки помилок
""")

    report.add_sub_section("Структура проєкту")
    report.add_listing("./PracticeProject/PRACTICE_PROJECT_STRUCTURE.md")

    report.add_sub_section("Вимоги до реалізації")
    report.add_list(f"""
Використовувати мову програмування C.

Застосувати принципи модульності та організації коду в окремі функції та модулі.
Забезпечити обробку помилок та коректну взаємодію між різними модулями.
Написати тестування для перевірки основних функціональних можливостей системи.
""")

    report.add_sub_section("Хід виконання роботи")

    report.add_listings_of_all_files("PracticeProject")
    report.add_images_of_all_files("PracticeProject/Images")

    report.add_source_list()

    report.save()
